publish/svn-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-26 Thu 22:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SVN Cheatsheet</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">SVN Cheatsheet</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7091e01">svn info</a></li>
<li><a href="#org5a0df75">svn checkout</a></li>
<li><a href="#orgbd58291">svn list</a></li>
<li><a href="#org80f2331">svn cat</a></li>
<li><a href="#org5ad5a64">svn log</a>
<ul>
<li><a href="#org90861f8">查看</a></li>
<li><a href="#orga33aa3a">编辑</a></li>
</ul>
</li>
<li><a href="#org6892560">svn update</a></li>
<li><a href="#org0a30eb7">svn commit</a></li>
<li><a href="#orgd1456b6">svn diff</a>
<ul>
<li><a href="#org73ea184">diff 美化</a></li>
</ul>
</li>
<li><a href="#org2128ec7">svn delete</a></li>
<li><a href="#org4ae4c5e">其他</a>
<ul>
<li><a href="#org322a4e9">节省输入</a></li>
</ul>
</li>
<li><a href="#org7d2b2e4">参考链接</a></li>
</ul>
</div>
</div>
<p>
本文整理一些 SVN 的常用指令，方便查询使用。
</p>

<p>
命令行相对来说还是有些麻烦的，你也可以使用 GUI 去完成 SVN 操作。
</p>

<p>
Window 上有 <a href="https://tortoisesvn.net/">TortoiseSVN</a>，Mac 有 <a href="https://www.smartsvn.com/">SmartSVN</a> 。
</p>

<p>
笔者当时用的就是 <code>SmartSVN</code> ，但有些功能需要付费，有的地方也不方便，所以就学习了命令行操作。
</p>

<p>
或者也可以用 <code>Emacs</code> ， 它集成了一套还不错的版本控制操作， <code>Emacs</code> 结合命令行，基本上可以覆盖我所有的使用场景了。
</p>

<div id="outline-container-org7091e01" class="outline-2">
<h2 id="org7091e01">svn info</h2>
<div class="outline-text-2" id="text-org7091e01">
<p>
查看 SVN 仓库信息。
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt;  svn info
Path: .

Working Copy Root Path: /Users/spike/Documents/svn/project/xxxx
URL: http://1.1.1.1/xxx/xxx/xxx
Relative URL: ^/xxxx
Repository Root: xxxx
Repository UUID: xxxxx
Revision: 28885
Node Kind: directory
Schedule: normal
Last Changed Author: xxx
Last Changed Rev: 28885
Last Changed Date: 2021-07-30 16:42:16 +0800 <span style="color: #000000;">(</span>&#20116;, 30  7 2021<span style="color: #000000;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a0df75" class="outline-2">
<h2 id="org5a0df75">svn checkout</h2>
<div class="outline-text-2" id="text-org5a0df75">
<p>
获取到 SVN 仓库地址后，拉取仓库代码。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn checkout URL
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd58291" class="outline-2">
<h2 id="orgbd58291">svn list</h2>
<div class="outline-text-2" id="text-orgbd58291">
<p>
当知道 SVN 仓库的 URL，可以通过 <code>svn list</code> 查看仓库下包行那些 Tags，哪些分支。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn list URL
</pre>
</div>
</div>
</div>

<div id="outline-container-org80f2331" class="outline-2">
<h2 id="org80f2331">svn cat</h2>
<div class="outline-text-2" id="text-org80f2331">
<p>
查看 <code>menu.jsp</code> 在 <code>12343</code> 版本的内容。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn cat menu.jsp -r 12343
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ad5a64" class="outline-2">
<h2 id="org5ad5a64">svn log</h2>
<div class="outline-text-2" id="text-org5ad5a64">
</div>
<div id="outline-container-org90861f8" class="outline-3">
<h3 id="org90861f8">查看</h3>
<div class="outline-text-3" id="text-org90861f8">
<p>
查看最近 10 条提交记录。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn log -l 10
</pre>
</div>

<p>
查看 2020-01-01 到 2020-12-31，包含 msg 和 msg2 的日志。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn log  --search <span style="color: #3548cf;">'msg'</span> --search-and <span style="color: #3548cf;">'msg2'</span> -r <span style="color: #000000;">{</span>2020-01-01<span style="color: #000000;">}</span>:<span style="color: #000000;">{</span>2020-12-31<span style="color: #000000;">}</span>
</pre>
</div>

<p>
查看某个提交涉及的改动文件。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn log -v -r &lt;REV&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orga33aa3a" class="outline-3">
<h3 id="orga33aa3a">编辑</h3>
<div class="outline-text-3" id="text-orga33aa3a">
<p>
有时，提交信息错了，想去修改，可以通过以下命令：
</p>

<div class="org-src-container">
<pre class="src src-bash">svn propedit -r &lt;REV&gt; --revprop svn:log
</pre>
</div>

<p>
<code>&lt;REV&gt;</code> 是对应的日志序号，例如 1234。
</p>

<p>
这个命令会打开一个编辑器，让你编辑日志信息，但如果没有配置，就会出现一个报错:
</p>

<p>
<code>svn: could not use external editor to fetch log message</code>
</p>

<p>
可以去修改 SVN 的配置文件，指定编辑器。
</p>

<p>
在 Mac 中，路径一般是在 <code>~/.subversion/config</code> ， 找到 <code>editor-cmd</code> ，指定为你喜欢的编辑器即可。
</p>

<div class="org-src-container">
<pre class="src src-bash">*# Section for configuring external helper applications.
<span style="color: #000000;">[</span>helpers<span style="color: #000000;">]</span>
*# Set editor-cmd to the command used to invoke your text editor.
*#   This will override the environment variables that Subversion
*#   examines by default to find this information <span style="color: #000000;">(</span>$<span style="color: #005e8b;">EDITOR</span>,
                                                   *#   et al<span style="color: #000000;">)</span>.
editor-cmd = emacsclient
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6892560" class="outline-2">
<h2 id="org6892560">svn update</h2>
<div class="outline-text-2" id="text-org6892560">
<p>
更新 SVN 仓库。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn update
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a30eb7" class="outline-2">
<h2 id="org0a30eb7">svn commit</h2>
<div class="outline-text-2" id="text-org0a30eb7">
<p>
指定要提交的文件，然后提交。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn commit PATH...
</pre>
</div>

<p>
但是，项目中文件可能很多，一个一个去指定还是有些麻烦的。
</p>

<p>
SVN 支持从文件读取路径，于是可以这么做：
</p>

<ol class="org-ol">
<li><code>svn st -q | cut -c 9- &gt; ~/target.txt</code> 把改动的文件路径全部输出到一个文件中。</li>
<li>打开 <code>~/target.txt</code>, 看看有没有路径是需要删除的，有的话就删除，剩下的就是之后要提交的文件。</li>
<li><code>svn commit --targets ~/target.txt</code> 使用 <code>~/target.txt</code> 的内容进行提交。</li>
</ol>
</div>
</div>

<div id="outline-container-orgd1456b6" class="outline-2">
<h2 id="orgd1456b6">svn diff</h2>
<div class="outline-text-2" id="text-orgd1456b6">
<p>
查看某个文件在某个版本的改动。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn diff -c &lt;REV&gt; &lt;PATH&gt;
</pre>
</div>

<p>
查看 <code>menus.jsp</code> 在 <code>23304</code> 相对于 <code>23314</code> 的改动。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn diff menu.jsp -r 23304:23314
</pre>
</div>
</div>

<div id="outline-container-org73ea184" class="outline-3">
<h3 id="org73ea184">diff 美化</h3>
<div class="outline-text-3" id="text-org73ea184">
<p>
默认 <code>svn diff</code> 输出的内容颜色是一样的，只能通过 <code>+</code> 和 <code>-</code> 判断哪些是增加，哪些是删除。
</p>

<p>
为了直观一些，可以安装 <code>colordiff</code> 进行美化：
</p>

<ol class="org-ol">
<li><code>brew install colordiff</code> 安装 colordiff。</li>
<li><code>svn diff menu.jsp -r 23304:23314 | colordiff</code> 通过管道把输出交给 <code>colordiff</code> 美化。</li>
</ol>

<p>
具体可以参考 <a href="http://icodeit.org/2015/02/make-a-colorful-svn-diff/">制作一个更漂亮的SVN Diff命令</a>。
</p>

<p>
尽管已经有了颜色区分了，但还是不太方便比对，可以参考以下两篇文章，使用比对工具进行查看：
</p>

<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/25050303/is-there-any-free-svn-diff-tool-for-mac-instead-of-use-command-line-svn-diff">Is there any free svn diff tool for Mac Instead of use command line 'svn diff'</a></li>
<li><a href="https://gist.github.com/dtjm/523243">Wrapper to use OS X FileMerge when calling `svn diff`</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org2128ec7" class="outline-2">
<h2 id="org2128ec7">svn delete</h2>
<div class="outline-text-2" id="text-org2128ec7">
<p>
把文件从 SVN 中移除。删除后需要提交。
</p>

<div class="org-src-container">
<pre class="src src-bash">svn delete file...
svn delete directory...
</pre>
</div>
</div>
</div>


<div id="outline-container-org4ae4c5e" class="outline-2">
<h2 id="org4ae4c5e">其他</h2>
<div class="outline-text-2" id="text-org4ae4c5e">
</div>
<div id="outline-container-org322a4e9" class="outline-3">
<h3 id="org322a4e9">节省输入</h3>
<div class="outline-text-3" id="text-org322a4e9">
<p>
如果你使用命令行操作 <code>SVN</code> ， 总是频繁的输入重复的命令会很烦恼吧？
</p>

<p>
你可以通过定制一些别名来节省操作。
</p>

<p>
例如编辑日志，每次都要输入 <code>svn propedit -r &lt;REV&gt; --revprop svn:log</code> 就很麻烦，也有可能记不住那么多参数。
</p>

<p>
笔者使用的是 <code>zsh</code> ，在 <code>.zshrc</code> 中可以定义函数, 如：
</p>

<div class="org-src-container">
<pre class="src src-zsh"># edit svn log
function editSvnLog() {
    cd "/Users/spike/Documents/svn/project/xxxx/"
    svn propedit -r "$1" --revprop svn:log
    cd -
}
</pre>
</div>

<p>
之后，我就可以调用 <code>editSvnLog xxxx</code> 去编辑日志，输入要修改的 <code>xxxx</code> 对应的提交信息了。
</p>

<p>
如果你用的是 <code>bash</code>, 那就改 <code>.bashrc</code> 。
</p>
</div>
</div>
</div>

<div id="outline-container-org7d2b2e4" class="outline-2">
<h2 id="org7d2b2e4">参考链接</h2>
<div class="outline-text-2" id="text-org7d2b2e4">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/1516188/svn-commit-specific-files">SVN Commit Specific files</a></li>
<li><a href="https://stackoverflow.com/questions/21720865/how-to-view-changes-made-to-files-on-a-certain-revision-in-subversion">How to view changes made to files on a certain revision in Subversion</a></li>
<li><a href="https://stackoverflow.com/questions/86049/how-do-i-ignore-files-in-subversion">How do I ignore files in Subversion?</a></li>
<li><a href="https://stackoverflow.com/questions/7131670/make-a-bash-alias-that-takes-a-parameter">Make a Bash alias that takes a parameter?</a></li>
<li><a href="https://svnbucket.com/posts/">svnbucket</a></li>
<li><a href="https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/developer_guide/sect-revision_control_systems-svn-file">1.2.4. Adding, Renaming, and Deleting Files</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: Spike Leung (<a href="mailto:l-yanlei@hotmail.com">l-yanlei@hotmail.com</a>)</p>
<p class="date">Date: 2021-08-15 Sun 00:00</p>
</div>
</body>
</html>
